# Задание 1
# За день машина проезжает n километров. Сколько дней нужно, 
# чтобы проехать по маршруту длиной m километров? 
# При:
# Input:
# n = 700
# m = 750
# Output:
# 2

speed = 700
length = 1400
print((length + speed - 1) // speed)
